Just want to specify: the issue is not related to the resources the build creates using terraform (if needed I can share the set of tf files). What the issue is, is about the execution of the `terraform apply` step, specifically when creating a Google Workspace user. This is actually the output of `terraform plan`

```
Step #1 - "tf plan": Terraform will perform the following actions:
Step #1 - "tf plan": 
Step #1 - "tf plan":   # google_folder.project_folder will be created
Step #1 - "tf plan":   + resource "google_folder" "project_folder" {
Step #1 - "tf plan":       + create_time     = (known after apply)
Step #1 - "tf plan":       + display_name    = "Test"
Step #1 - "tf plan":       + folder_id       = (known after apply)
Step #1 - "tf plan":       + id              = (known after apply)
Step #1 - "tf plan":       + lifecycle_state = (known after apply)
Step #1 - "tf plan":       + name            = (known after apply)
Step #1 - "tf plan":       + parent          = "organizations/REDACTED"
Step #1 - "tf plan":     }
Step #1 - "tf plan": 
Step #1 - "tf plan":   # google_folder_iam_member.folder_admin_role will be created
Step #1 - "tf plan":   + resource "google_folder_iam_member" "folder_admin_role" {
Step #1 - "tf plan":       + etag   = (known after apply)
Step #1 - "tf plan":       + folder = (known after apply)
Step #1 - "tf plan":       + id     = (known after apply)
Step #1 - "tf plan":       + member = "user:test-admin@REDACTED"
Step #1 - "tf plan":       + role   = "roles/resourcemanager.folderAdmin"
Step #1 - "tf plan":     }
Step #1 - "tf plan": 
Step #1 - "tf plan":   # google_organization_iam_member.org_viewer_role will be created
Step #1 - "tf plan":   + resource "google_organization_iam_member" "org_viewer_role" {
Step #1 - "tf plan":       + etag   = (known after apply)
Step #1 - "tf plan":       + id     = (known after apply)
Step #1 - "tf plan":       + member = "user:test-admin@REDACTED"
Step #1 - "tf plan":       + org_id = "REDACTED"
Step #1 - "tf plan":       + role   = "roles/resourcemanager.organizationViewer"
Step #1 - "tf plan":     }
Step #1 - "tf plan": 
Step #1 - "tf plan":   # google_project.project will be created
Step #1 - "tf plan":   + resource "google_project" "project" {
Step #1 - "tf plan":       + auto_create_network = true
Step #1 - "tf plan":       + billing_account     = "REDACTED"
Step #1 - "tf plan":       + folder_id           = (known after apply)
Step #1 - "tf plan":       + id                  = (known after apply)
Step #1 - "tf plan":       + name                = "Test"
Step #1 - "tf plan":       + number              = (known after apply)
Step #1 - "tf plan":       + org_id              = (known after apply)
Step #1 - "tf plan":       + project_id          = (known after apply)
Step #1 - "tf plan":       + skip_delete         = (known after apply)
Step #1 - "tf plan":     }
Step #1 - "tf plan": 
Step #1 - "tf plan":   # google_project_iam_member.project_owner_role will be created
Step #1 - "tf plan":   + resource "google_project_iam_member" "project_owner_role" {
Step #1 - "tf plan":       + etag    = (known after apply)
Step #1 - "tf plan":       + id      = (known after apply)
Step #1 - "tf plan":       + member  = "user:test-admin@REDACTED"
Step #1 - "tf plan":       + project = (known after apply)
Step #1 - "tf plan":       + role    = "roles/owner"
Step #1 - "tf plan":     }
Step #1 - "tf plan": 
Step #1 - "tf plan":   # gsuite_user.admin will be created
Step #1 - "tf plan":   + resource "gsuite_user" "admin" {
Step #1 - "tf plan":       + 2s_enforced            = (known after apply)
Step #1 - "tf plan":       + 2s_enrolled            = (known after apply)
Step #1 - "tf plan":       + agreed_to_terms        = (known after apply)
Step #1 - "tf plan":       + creation_time          = (known after apply)
Step #1 - "tf plan":       + customer_id            = (known after apply)
Step #1 - "tf plan":       + etag                   = (known after apply)
Step #1 - "tf plan":       + id                     = (known after apply)
Step #1 - "tf plan":       + include_in_global_list = true
Step #1 - "tf plan":       + is_admin               = (known after apply)
Step #1 - "tf plan":       + is_delegated_admin     = (known after apply)
Step #1 - "tf plan":       + is_ip_whitelisted      = false
Step #1 - "tf plan":       + is_mailbox_setup       = (known after apply)
Step #1 - "tf plan":       + is_suspended           = false
Step #1 - "tf plan":       + last_login_time        = (known after apply)
Step #1 - "tf plan":       + name                   = {
Step #1 - "tf plan":           + "family_name" = "REDACTED"
Step #1 - "tf plan":           + "given_name"  = "REDACTED"
Step #1 - "tf plan":         }
Step #1 - "tf plan":       + org_unit_path          = "/"
Step #1 - "tf plan":       + password               = "REDACTED"
Step #1 - "tf plan":       + primary_email          = "REDACTED"
Step #1 - "tf plan":     }
Step #1 - "tf plan": 
Step #1 - "tf plan":   # random_id.id will be created
Step #1 - "tf plan":   + resource "random_id" "id" {
Step #1 - "tf plan":       + b64_std     = (known after apply)
Step #1 - "tf plan":       + b64_url     = (known after apply)
Step #1 - "tf plan":       + byte_length = 4
Step #1 - "tf plan":       + dec         = (known after apply)
Step #1 - "tf plan":       + hex         = (known after apply)
Step #1 - "tf plan":       + id          = (known after apply)
Step #1 - "tf plan":     }
Step #1 - "tf plan": 
Step #1 - "tf plan": Plan: 7 to add, 0 to change, 0 to destroy.
Step #1 - "tf plan": 
Step #1 - "tf plan": Changes to Outputs:
Step #1 - "tf plan":   + project_id = (known after apply)
Step #1 - "tf plan": 
```